/*******************************************************
 * 模块名称 : 指示灯驱动模块
 * 文件名	  : BSPUSART.H
 * 说明  	  : 头文件,提供自定义数据类型及外部调用的接口函数的声明
 * 版本号	  : v1.0
 * 修改记录 :
 * 	版本号		日期		作者
 * 	v1.0	     2020-7-5	               李康伟
 ********************************************************/

#ifndef BSP_USART_BSPUSART_H_
#define BSP_USART_BSPUSART_H_
#include "stm32f1xx_hal.h"




/********************************************************
 本模块提供给外部调用的函数
 ********************************************************/




#endif /* BSP_USART_BSPUSART_H_ */
/********************(END OF FILE)***********************/



