///*******************************************************
// * 模块名称 : MH-Z19B驱动模块
// * 文件名	  : BSPMH_Z19B.H
// * 说明  	  : 头文件,提供自定义数据类型及外部调用的接口函数的声明
// * 版本号	  : v1.0
// * 修改记录 :
// * 	版本号		日期		作者
// * 	v1.0	     2020-4-16	               李康伟
// ********************************************************/

#ifndef BSP_MH_Z19B_H_
#define BSP_MH_Z19B_H_


#include "stm32f1xx_hal.h"
#include "stdbool.h"
#include "string.h"

#include "main.h"
#include "gpio.h"

/********************************************************
 本模块提供给外部调用的函数
 ********************************************************/

void BSP_CO2_Read (uint16_t * concentration);




#endif /* BSP_MH_Z19B_H_ */
